agenda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-14 Fri 20:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Agenda</title>
<meta name="author" content="Huan Min" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Agenda</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcb12109">1. Assignment 07 Done</a>
<ul>
<li><a href="#org8941dc3">1.1. <span class="done DONE">DONE</span> LIST</a></li>
<li><a href="#orgf0b3713">1.2. <span class="todo TODO">TODO</span> LIST</a></li>
<li><a href="#org8c4bcd1">1.3. <span class="todo IDEA">IDEA</span> List</a>
<ul>
<li><a href="#org7ee53d9">1.3.1. LOG</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgcb12109" class="outline-2">
<h2 id="orgcb12109"><span class="section-number-2">1.</span> Assignment 07 Done</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8941dc3" class="outline-3">
<h3 id="org8941dc3"><span class="section-number-3">1.1.</span> <span class="done DONE">DONE</span> LIST</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li><p>
Install the ur<sub>description</sub>
<a href="https://github.com/UniversalRobots/Universal_Robots_ROS2_Description">ur<sub>description</sub></a>
</p>
<div class="org-src-container">
<pre class="src src-shell">    <span style="color: #ECBE7B;">sudo</span> apt install ros-galactic-ur-decription
</pre>
</div></li>
<li>Create the template of the package
<ul class="org-ul">
<li>CMake.file</li>
<li>rtt<sub>ur.cpp</sub>
<ul class="org-ul">
<li>constructor
<ul class="org-ul">
<li>construct Port,addOperation</li>
<li>construct ros service</li>
<li>declare parameter</li>
<li>subscribe an topic</li>
</ul></li>
</ul></li>
<li>startHook
<ul class="org-ul">
<li>initialize the joint and Cartesian port(ip,op,rml),joint(currentPosition,CurrentVelocity,CurrentAcceleration)</li>
</ul></li>
<li>configureHook</li>
<li>updateHook</li>
<li>stopHook</li>
<li>cleanHook</li>
<li>ur.ops
<ul class="org-ul">
<li>Write scripts ops load component and stream the topic of ROS</li>
<li>load the componet</li>
<li>set the actvity</li>
<li>create node name</li>
<li>stream the topic for publish</li>
<li>import(&ldquo;rtt<sub>ur</sub><sub>trajectory</sub>&rdquo;)</li>
</ul></li>
</ul></li>

<li>Externally Load the urdf of Ur5 into Orocos
<ol class="org-ol">
<li><p>
set param /para<sub>name</sub> &ldquo;`xacro ur.urdf.xacro args:= &#x2026;.`&rdquo;
</p>
<div class="org-src-container">
<pre class="src src-shell"> ros2 param set /ur5 ur5_description <span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">`xacro ur.urdf.xacro`</span><span style="color: #98be65;"> --param</span>
<span style="color: #98be65;"> safety_limits:= TRUE, safety_pos_margin:= 0.15,safety_k_position:=20, name:='ur', ur_type:= 'ur5e',prefix:=''</span>


</pre>
</div></li>
</ol></li>
<li>Internally load the urdf in to Orocos
<ol class="org-ol">
<li>first we need subscribe the param from launch file</li>
<li>we need write the content of subscribition and to set parameter for the one we declare in cpp.</li>
</ol></li>
<li>Have two Operation MoveJ and MoveC
<ol class="org-ol">
<li>MoveJ : KDL::JntArray -&gt; desired joint position
<ul class="org-ul">
<li></li>
</ul></li>
<li>MoveC : KDL::Frame -&gt; desired Cartesian frame of Ur5</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orgf0b3713" class="outline-3">
<h3 id="orgf0b3713"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> LIST</h3>
</div>
<div id="outline-container-org8c4bcd1" class="outline-3">
<h3 id="org8c4bcd1"><span class="section-number-3">1.3.</span> <span class="todo IDEA">IDEA</span> List</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org7ee53d9" class="outline-4">
<h4 id="org7ee53d9"><span class="section-number-4">1.3.1.</span> LOG</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
What&rsquo;s the meaning of Rtt::OperationCaller&lt;signature&gt; what&rsquo;s the signature?
</p>
<ul class="org-ul">
<li>we dont need operationcaller for this task;</li>
</ul>
<p>
How to write the launch file in python.
<a href="https://roboticscasual.com/tutorial-ros2-launch-files-all-you-need-to-know/#launch-substitutions">launch.py tutorial</a>
issue: IK failed -&gt; q<sub>init</sub> should be the current joint state;
launch file workflow
jntMsr -&gt; read jointState
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Huan Min</p>
<p class="date">Created: 2023-04-14 Fri 20:52</p>
</div>
</body>
</html>